# UnboundedHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Room..::..UnboundedHeight Property
Room Class See Also
---
Get the Unbounded Height of the Room.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double UnboundedHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UnboundedHeight As Double
	Get
```

Visual C++
---
```text
public:
property double UnboundedHeight {
	double get ();
}
```

# Remarks
This property is used to get the Unbounded Height of the Room.
# See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace